Revit 2027 API
Revision.GetAllRevisionIds Method
 Returns the ids of all Revisions in the project ordered by sequence number.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ElementId> GetAllRevisionIds(
	Document document
)
Public Shared Function GetAllRevisionIds (
	document As Document
) As IList(Of ElementId)
public:
static IList<ElementId^>^ GetAllRevisionIds(
	Document^ document
)
static member GetAllRevisionIds :
        document : Document -> IList<ElementId>
Parameters
document Document
 The document containing the Revisions.
Return Value
IList<ElementId>
 The ids of all the Revisions in the document ordered by sequence number.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace